In [2]:
import pandas as pd

In [3]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [4]:
df.groupby("Team")  # Gives Object

In [5]:
df.groupby('Team').groups   # shows groups formed

{'Devils': [2, 3], 'Kings': [4, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10], 'kings': [5]}

group by multiple values

In [6]:
df.groupby(['Team','Year']).groups

{('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('Kings', 2016): [6], ('Kings', 2017): [7], ('Riders', 2014): [0], ('Riders', 2015): [1], ('Riders', 2016): [8], ('Riders', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10], ('kings', 2015): [5]}

In [7]:
grouped=df.groupby('Year')
for i in grouped:
    print(i)

(2014,      Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804)
(2016,      Team  Rank  Year  Points
6   Kings     1  2016     756
8  Riders     2  2016     694)
(2017,       Team  Rank  Year  Points
7    Kings     1  2017     788
11  Riders     2  2017     690)

In [8]:
grouped2=df.groupby(['Team','Year'])
for i in grouped2:
    print(i)

(('Devils', 2014),      Team  Rank  Year  Points
2  Devils     2  2014     863)
(('Devils', 2015),      Team  Rank  Year  Points
3  Devils     3  2015     673)
(('Kings', 2014),     Team  Rank  Year  Points
4  Kings     3  2014     741)
(('Kings', 2016),     Team  Rank  Year  Points
6  Kings     1  2016     756)
(('Kings', 2017),     Team  Rank  Year  Points
7  Kings     1  2017     788)
(('Riders', 2014),      Team  Rank  Year  Points
0  Riders     1  2014     876)
(('Riders', 2015),      Team  Rank  Year  Points
1  Riders     2  2015     789)
(('Riders', 2016),      Team  Rank  Year  Points
8  Riders     2  2016     694)
(('Riders', 2017),       Team  Rank  Year  Points
11  Riders     2  2017     690)
(('Royals', 2014),      Team  Rank  Year  Points
9  Royals     4  2014     701)
(('Royals', 2015),       Team  Rank  Year  Points
10  Royals     1  2015     804)
(('kings', 2015),     Team  Rank  Year  Points
5  kings     4  2015     812)

In [9]:
#OTHER way
df.groupby('Year').get_group(2015)

      Team  Rank  Year  Points
1   Riders     2  2015     789
3   Devils     3  2015     673
5    kings     4  2015     812
10  Royals     1  2015     804

In [10]:
df.groupby('Team').get_group('Kings')

    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788


Aggregation

In [11]:
import numpy as np
grp1=df.groupby('Team')
grp1

In [12]:
grp1['Points'].agg(np.sum)

C:\Users\ACER PREDATOR\AppData\Local\Temp\ipykernel_7948\2015192940.py:1: FutureWarning: The provided callable <function sum at 0x000001DF70353060> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  grp1['Points'].agg(np.sum)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [13]:
grp1.agg(np.size)

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [14]:
grp1.count()

        Rank  Year  Points
Team
Devils     2     2       2
Kings      3     3       3
Riders     4     4       4
Royals     2     2       2
kings      1     1       1

In [15]:
grp1.sum()

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      5  6047    2285
Riders     7  8062    3049
Royals     5  4029    1505
kings      4  2015     812

ZSCORE CALCULATION   FORMULA = X - MEAN OF X DIVIDED BY STANDARD DEVIATION OF X

In [16]:
grouped_value=df.groupby('Team')
z_score=lambda x:(x-x.mean())/x.std()
grouped_value.transform(z_score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   1.154701 -1.091089 -0.860862
5        NaN       NaN       NaN
6  -0.577350  0.218218 -0.236043
7  -0.577350  0.872872  1.096905
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

Filter Function

In [17]:
df.groupby('Team').filter(lambda x: len(x)>=3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

Merge and Join
Both are used to join two or more dataframes but with some differnces

Join : combines dataframes based on indexes,missing values are filled with NaN,default joining done through leftjoin

Merge : combines dataframes based on key or columns,missing values are dropped,default joining done through innerjoin

Join Example

In [ ]:
# create sample data
data1 = {
    'A': [1, 2, 3], 
    'B': [4, 5, 6]
     }
df1 = pd.DataFrame(data1, index=['a', 'b', 'c'])

data2 = {
         'C': [10, 20, 30],
         'D': [40, 50, 60]
         }
df2 = pd.DataFrame(data2, index=['a', 'c', 'd'])

In [19]:
df1.join(df2)

   A  B     C     D
a  1  4  10.0  40.0
b  2  5   NaN   NaN
c  3  6  20.0  50.0

In [20]:
df1.join(df2,how='right')

     A    B   C   D
a  1.0  4.0  10  40
c  3.0  6.0  20  50
d  NaN  NaN  30  60

Merge Example

In [21]:
data1 = {'A': [1, 2, 3], 'B': [4, 5, 6], 'key': ['a', 'b', 'c']}
df1 = pd.DataFrame(data1)

data2 = {'C': [10, 20, 30], 'D': [40, 50, 60], 'key': ['a', 'c', 'd']}
df2 = pd.DataFrame(data2)

In [22]:
pd.merge(df1,df2)

   A  B key   C   D
0  1  4   a  10  40
1  3  6   c  20  50

In [23]:
pd.merge(df1,df2,how='outer')

     A    B key     C     D
0  1.0  4.0   a  10.0  40.0
1  2.0  5.0   b   NaN   NaN
2  3.0  6.0   c  20.0  50.0
3  NaN  NaN   d  30.0  60.0